function document_2() {
    document.getElementById('myModalLabel').innerHTML = '文档2';
    document.getElementById('myModalBody').innerHTML = '<h4>【文档2】</h4><br>' +
        '所有被监视的映射都有一个共同点，他们都叫做陈国宝。<br><br>' +
        '准确来说他们的名字发音都是或者形似中文中“陈国宝”这三个字的发音。<br><br>' +
        '性别与工作并没有一定的规律，行为方式与常人无益。<br><br>' +
        '但是在他们的身边都出现过幻想级别的事件，不过基金会至今没有直接与他们进行接触，仅仅是监视他们的行踪。<br><br>' +
        '<h4>【文档2 附录】</h4><br>' +
        '<h5>scp-cgb-un-1</h5>' +
        '在监视的三年中一直为一位正常行为的中年男性。<br><br>' +
        '2008年██月██日，在其生病住院时，名为███的晚癌患者【为编号cgb-p-12】竟然奇迹般康复。cgb-p-12，被基金会列入观察目标，在███的检查下，我们发现在他体内没有任何癌细胞的痕迹，以及存在过造成损伤的痕迹。而cgb-p-12的身体的状态曲线，完全拟合███计算机计算下，其若没有患过癌症的正常身体状态曲线。<br><br>' +
        '<h5>scp-cgb-un-7</h5>' +
        '一位89岁的女性。<br><br>' +
        '在2014年去世，年终89岁，在她的死亡为自然死亡，没有出现任何异变，以及幻想级别的现象，如今基金会对其埋葬的墓地一直保持着监视。'
    $('#myModal').modal('show')
}

function ex2_1() {
    document.getElementById('myModalLabel').innerHTML = '附录2-1';
    document.getElementById('myModalBody').innerHTML = '<h4>【附录2-1】</h4><br>' +
        'μ13 机动特遣队Mu-13 封锁了现场。<br><br>' +
        '以目标为中心的三公里地带内的所有人类受到███模因的影响不由自主的远离目标。<br><br>' +
        '收容行动开始。<br><br>' +
        'Mu-13发现目标，发现目标为正常人类形体，但是Mu-13并没有怠慢，接触小队开始进行和平行为接触。<br><br>' +
        '在Mu-13开始进行接触时，目标说：你们是scp的人吗。<br><br>' +
        'Mu-13队长马上与基金会上层进行联系，其余队员将目标包围在中心。<br><br>' +
        '（初步判断为智能人形物种，基本的搜索装置确定为碳基生物，周围没有任何异常反应与事件）<br><br>' +
        'Mu-13队长收到指令，准备麻醉目标并将目标带往最近的收容所。<br><br>' +
        '【已编辑】<br><br>' +
        '所有麻醉设备都消失了。<br><br>' +
        'Mu-13队长紧急修改指令，准备以拘束方式。<br><br>' +
        '同样的情况，拘束设备也消失了。<br><br>' +
        '（据Mu-13队员的回忆，设备消失本来应该会产生的重量差感，并没有出现，似乎，从一开始这些设备就被确定不存在，但是在出动时，所有人都确定已经携带了设备。）<br><br>' +
        '最后Mu-13队长邀请目标到最近的收容所做客。<br><br>' +
        '目标欣然同意。'
    $('#myModal').modal('show')
}

function ex3_2() {
    document.getElementById('myModalLabel').innerHTML = '附录3-2';
    document.getElementById('myModalBody').innerHTML = '<h4>【附录3-2】</h4><br>' +
        '基金会派遣3名B特工秘密进行了绑架作业。<br><br>' +
        '绑架了一名映射体身边的学生进行了实验。<br><br>' +
        '在███的扫描下，得到结果：<br><br>' +
        '1、没有受到模因的影响。<br><br>' +
        '2、没有出现幻觉，洗脑等现象。<br><br>' +
        '3、纯粹自发性，没有代表任何信仰和崇拜。<br><br>' +
        '学生进行了【记忆删除】<br><br>' +
        '<pre>实验scp-cgb-12<br><br>' +
        '我们将映射体送到英国生活了一段时间。<br>' +
        '映射体可以熟练的使用英文沟通，并且我们要求映射体只使用英文进行沟通。<br>' +
        '2周后，与映射体开始接触的英国人都开始说“陈国宝牛逼”，虽然发音蹩脚，<br>' +
        '但是我们可以确定是中文的“陈国宝牛逼”的发音。<br>' +
        '与设想中的 “Guobao Chen is Niubility”不同，英国人并没有使用英文<br>' +
        '的发音而是直接使用了中文，当他们被问起这句话是什么意思的时候，<br>' +
        '他们的回答非常一致：不知道。为什么说呢？回答：不知道。<br>' +
        '同样的实验在西班牙，韩国，日本都有进行，其中获得了同样的结果。<br>' +
        '之后我们让映射体当了两周的动物园管理员，所有动物都会艰难的发出<br>' +
        '“陈国宝牛逼”的发音，完全自发性。【所有动物在实验后被抹杀】</pre>'
    $('#myModal').modal('show')
}

function secret_2() {
    document.getElementById('myModalLabel').innerHTML = '绝密档案2';
    document.getElementById('myModalBody').innerHTML = '<h4>【绝密档案2】</h4><br>' +
        'A:代号L  【许可级别：site 主任】<br><br>' +
        'B:scp-cgb映射体<br><br>' +
        '地点:【数据删除】<br><br>' +
        'A:请问我该如何称呼您？<br><br>' +
        'B:你直接叫我陈国宝就好了，或者可以称呼我为映射体。<br><br>' +
        'A:这意味着你是某个生物的映射吗。<br><br>' +
        'B:这不是显然的意思吗，还是你只是想确认一下。<br><br>' +
        'A:请问你是人类吗？<br><br>' +
        'B:在物理层面上是货真价实的人类。<br><br>' +
        'A:那在其他意义上呢？<br><br>' +
        'B:【沉默】。<br><br>' +
        'A:请问你是如何改变磁场的？<br><br>' +
        'B:我想让它改变，他就改变了。<br><br>' +
        'A:请问能更具体一点吗？<br><br>' +
        'B:我觉得这已经足够具体了。<br><br>' +
        'A:请问“想”是一个什么样的过程。<br><br>' +
        'B:我在大脑中想“地球的磁场指向我”。<br><br>' +
        '（在远程观看的De博士: 完全抽象的命令，那如果不符合逻辑呢）。<br><br>' +
        '（A与De博士进行了短暂的交谈）<br><br>' +
        '（De博士与██进行了交谈。）<br><br>' +
        'De博士：请问能让你配合我做一个实验吗。请让全世界的指南针指向你。<br><br>' +
        'De博士：令人惊异的奇观。<br><br>' +
        '<pre>实验scp-cgb-1【绝密】<br><br>' +
        '在De博士提出要求后的2s后。<br>' +
        '全世界的指南针都指向了映射体，包括但是不限于：普通指南针，手机端指南针，<br>' +
        '手表指南针，游戏中的指南针。<br>' +
        'D级人员在磁场阻隔设施中的指南针。<br>' +
        '以及受到催眠（认为手里是指南针）的D级人员手中的形式指南针的非指南针物体。<br>' +
        '——————————————————————————————————————<br>' +
        '地球磁场没有收到任何的变化。<br>' +
        '所有与指南针有关的工具的工作都依旧正常进行。<br>' +
        '在整个实验过程中████对于映射体都处于扫描状态。<br>' +
        '映射体本身没有任何能量交换，没有任何物质改变，没有出现任何“变化”。<br>' +
        '宇宙的熵没有出现不规则的变动。<br>' +
        '——————————————————————————————————————<br>' +
        '只呈现了果并且忽视了所有因，扭曲了现实，乃至扭曲了逻辑，<br>' +
        '——De博士</pre><br>' +
        'B:至少在想象之中吧。<br><br>' +
        'De博士：请问你的主体是什么样的。<br><br>' +
        'B:不知道。<br><br>' +
        'De博士：请问……（被打断）。<br><br>' +
        'B:今天就到这里吧，我等下还要上课。'
    $('#myModal').modal('show')
}

function secret_3() {
    document.getElementById('myModalLabel').innerHTML = '绝密档案3';
    document.getElementById('myModalBody').innerHTML = '<h4>【绝密档案3】</h4><br>' +
        '<pre>█.A博士：你觉得他是否只是涉及到了扭曲因果的能力。<br>' +
        '█.B 博士：可能不仅仅是扭曲了因果。<br>' +
        '█.A 博士：你的意思是，观念也被扭曲了吗。<br>' +
        'De 博士：可能还要更进一步。<br>' +
        '█.A 博士：规则吗……<br>' +
        '█.B 博士：你是说他用某种幻想层次的力量，改变了规则。<br>' +
        'De 博士：可能是这样的，scp-█在他改变的时候并没有反应，就是说，观念还是原来的观念，<br>' +
        '我们在实验的过程中，还是处于现实，整个地球，也是处于现实，并不是虚幻的梦境。<br>' +
        '█.A 博士：【沉默】【思考】可是这样子的话，启动因子呢，他靠什么来改变呢。<br>' +
        '【良久沉默】<br>' +
        'De博士：或者是……更夸张一点，他就是规则本身。<br>' +
        '█.A博士：你知道你在说什么吗。如果他就是规则本身，同时具体化的呈现出来，这就意味着……<br>' +
        'De博士：是的，这就意味着，他的存在可能已经涉及到了 “他/她/它”（以下用Ta代替）。<br>' +
        '█.B博士：（笑了笑）那现在的我们可就已经有生命危险了，如果已经涉及到Ta。<br><br>' +
        '【已编辑】<br>' +
        '【已编辑】<br>' +
        '【已编辑】<br>' +
        '【已编辑】<br>' +
        '【已编辑】<br>' +
        '【已编辑】<br>' +
        '【已编辑】</pre><br>' +
        '<pre>【附录#7-1】' +
        'De博士：你知道Ta吗？<br>' +
        'B：【沉默】。<br>' +
        'De博士：你是规则吗？<br>' +
        'B:【沉默】。<br>' +
        'De博士：不能说吗。<br>' +
        'B:不是不能，是我不想说。<br>' +
        'De博士：为什么。<br>' +
        'B:不想。<br>' +
        '【沉默】<br>' +
        'De博士：是因为你说完我会被【数据删除】抹杀吗。<br>' +
        'B:【沉默】【微笑】。<br>' +
        '（De博士备注：假设如果B是一个善意个体的话，同时他也不在乎一切的话）<br>' +
        '（不，我不知道他的思考方式，不，或许他是不是需要思考都是一个问题。）<br>' +
        '（等下，这样是否可以猜测【数据删除】不仅仅是猜想而是存在。）<br>' +
        'B:我只是一个映射罢了。<br>' +
        '（他是在提醒我吗，这是什么意思。）<br>' +
        'B:我只能说这么多了。<br>' +
        'De博士：我是否能认为，你在对话中已经隐喻了某种，与本质有关的东西。<br>' +
        'B:是的。</pre>'
    $('#myModal').modal('show')
}